system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0 0 0)
    ( 0 16 0)
    ( 0 0 8)
    ( 0 16 8)
    ( 10 0 0)
    ( 10 16 0)
    ( 10 0 8)
    ( 10 16 8)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (100 100 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
 
  Inlet
  {
  	type patch;
	faces 
	(
	 (0 4 6 2)
	);
  }
  Outlet
  {
        type patch;
        faces 
	(
	 (1 5 7 3)
	);
  }
  Side1
  {
        type patch;
        faces 
	(
	 (4 5 7 6)
	);
  }
  Side2
  {
        type patch;
        faces 
	(
	 (0 1 3 2)
	);
  }
  top
  {
        type patch;
        faces 
	(
	 (6 7 3 2)
	);
  }
  bottom
  {
        type patch;
        faces 
	(
	 (4 5 1 0)
	);
  }

);


// ************************************************************************* //
