0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Side1
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    Side2
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    prop
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
