0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00341;

boundaryField
{
    Inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.00341;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Side1
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }
    Side2
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }
    prop
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0.00341;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0.00341;
    }
}


// ************************************************************************* //
